---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.SpaceTagType
source: html/7d4d4ab0-a336-f832-3b95-a845a22c4596.htm
---
# Autodesk.Revit.DB.Mechanical.SpaceTagType

An object that represents a Space Tag style.

## Syntax (C#)
```csharp
public class SpaceTagType : FamilySymbol
```